blogs = {'blog1':'<p>Меня зовут Ларс, и я черная длинношерстная немецкая овчарка. Мое имя в родословной — Тим Лихтенштейн Ост Лондон, и я горжусь этим!'
                 ' Я родился 01 ноября 2021 года, и с тех пор моя жизнь полна приключений и радостных моментов.</p><p>Мои родители — настоящие звезды среди собак.'
                 ' Мой отец, Де Орсе Мак Флай Еширо, — великолепный экземпляр породы,с мощной фигурой и умом, который поражает всех. Он всегда был для меня примером: '
                 'умный, храбрый и преданный.Моя мама, Тим Лихтенштейн Ост Тина Тернер, — невероятно грациозная и умная собака. '
                 'Она обладает добрым сердцем и всегда заботится обо всех нас. Я часто думаю, что мне повезло быть их сыном.</p>'
                 '<p>С раннего возраста я был полон энергии и любопытства. Я обожаю бегать по парку, играть с мячом и исследовать '
                 'каждый уголок своего двора. У меня много друзей среди собак, и мы часто собираемся вместе, чтобы весело провести время. '
                 'Я люблю учиться новым командам и трюкам — это делает мои дни еще более увлекательными.</p>'
                 '<p>Я также очень преданный своей семье. Я всегда рядом, когда они дома, и чувствую, когда им нужно внимание или поддержка.'
                 'Иногда я просто сижу рядом и смотрю на них, наслаждаясь их компанией. Я знаю, что они заботятся обо мне, и я хочу, чтобы'
                 'они знали, как я их люблю.</p> <p>Моя жизнь полна счастья, игр и любви. Я мечтаю о том дне, когда смогу стать настоящим защитником своей семьи, '
                 'как мой отец, и быть столь же мудрым и добрым, как моя мама. Каждый день — это новое приключение, и я готов его встречать с радостью и энергией!</p>',
         'blog2': '<p>Я, Ларс, черная длинношерстная немецкая овчарка, обожаю играть! Каждый день для меня — это новое приключение, полное радости и веселья. ' 
                 'Позвольте рассказать вам о моих любимых играх.</p> <p>Когда утро наступает, и солнечные лучи пробиваются через окно, я уже на ногах, с нетерпением' 
                 ' ожидая, когда моя семья проснется.Первое, что я делаю, — это прыгаю к ним на кровать и радостно вилляю хвостом. Они смеются и гладят меня, и я ' 
                 'чувствую, что день будет замечательным.</p> <p>После завтрака мы выходим на улицу. Это время для игры на свежем воздухе! Я обожаю бегать по парку, ' 
                 'где меня ждут мои пушистыедрузья. Мы устраиваем настоящие гонки, и я стараюсь бежать как можно быстрее, чувствуя ветер в ушах. Иногда я останавливаюсь' 
                 ',чтобы покрутиться вокруг своих друзей, и мы все вместе весело лаем друг на друга.</p><p>Одной из моих любимых игр является «принеси мяч». ' 
                 'Моя семья бросает мяч, и я с радостью мчусь за ним. Я чувствую, как адреналин наполняет меня, когда я прыгаю и ловлю мяч в воздухе. Возвращаясь, ' 
                 'я гордо приношу его обратно, и это снова повторяется.В такие моменты я чувствую себя настоящим чемпионом!</p> <p>После игр на улице я люблю немного'
                 ' поиграть и дома. У меня есть множество игрушек: мягкие мишки, канаты и даже мячики с пищалками. Я обожаю жевать свои игрушки, а иногда играю в ' 
                 'прятки, пряча свои игрушки в самых неожиданных местах. Моя семья смеется, когда находит их в неожиданных уголках дома, и я с гордостью смотрю на ' 
                 'них, как будто говорю: «Вот, смотрите, какое маленькое сокровище я нашел!»</p> <p>Вечером, когда наступает время покоя, я люблю устраиваться рядом ' 
                 'с любимыми людьми, положив голову им на колени. Они гладят меня, и я чувствую, как вся моя энергия постепенно уходит. Я мечтаю о завтрашних играх и '
                 'новых приключениях, ведь для меня каждый день — это возможность веселиться и радоваться жизни вместе с моей семьей.</p> <p>Так проходит мой день, '
                 'полный игр и счастья. Я, Ларс, черная длинношерстная немецкая овчарка, всегда готов к новым приключениями играм!</p>',
         'blog3' :' <p>Привет, друзья! Это снова я, Ларс, ваша любимая немецкая овчарка. Сегодня я хочу рассказать вам об одном из самых волнующих моментов в моей '
                  'жизни — моем первом знакомстве со снегом. Это был невероятный день, который я запомню навсегда!</p><p>Всё началось с того, что я проснулся и сразу '
                  'почувствовал что-то необычное. Воздух был прохладным, и в нём витал запах, который я никогда раньше не ощущал. Когда мой хозяин открыл дверь на '
                  'улицу, я замер на пороге, не веря своим глазам. Всё вокруг было белым! Деревья, земля, даже мой любимый двор — всё покрылось мягким, пушистым '
                  'покрывалом. Это было как в сказке!</p> <p>Сначала я осторожно ступил лапой на белый ковёр, ожидая, что это может быть что-то холодное или мокрое. '
                  'И знаете что? Это было и холодное, и мокрое одновременно, но очень приятно! Я тут же начал носом раскапывать снег, поднимая его в воздух. Оказалось,'
                  ' что снег можно ловить, когда он падает, и даже есть! Он был таким освежающим и вкусным, что я не мог остановиться.</p><p>Как только я понял, что снег'
                  ' — это безопасно и весело, я не мог перестать бегать и прыгать. Я мчался по двору, оставляя за собой следы, и ловил снежинки, которые кружились вокруг '
                  'меня. Мой хозяин смеялся, наблюдая, как я радуюсь. Мы вместе катали снежные шары, и я пытался поймать их до того, как они ударятся о землю. Но самый '
                  'лучший момент был, когда я узнал, что можно кататься на снегу, как на скользкой дорожке! Я бежал с холма, а потом специально ложился на бок и скользил'
                  ' вниз. Это было так весело!</p> <p>Снег подарил мне столько новых ощущений и радости. Я никогда не думал, что что-то может быть таким захватывающим. '
                  'Каждый шаг, каждая новая игра в снегу были для меня открытием. А когда солнце начало садиться, я устал и счастлив вернулся домой, с лапами, полными '
                  'снега, и сердцем, полным восторга.</p><p>Теперь я знаю, что зима — это не просто холодный сезон. Это время года, полное веселья и новых открытий. '
                  'С тех пор, каждый раз, когда падает снег, я снова становлюсь тем же щенком, который впервые увидел этот удивительный белый мир. Я рад, что могу поделиться '
                  'с вами этим воспоминанием, и надеюсь, что вы тоже любите снег так же сильно, как и я!</p><p>До следующей встречи, друзья! Ваш Ларс.</p>'}

title = {
    'blog1':'Знакомство: Это я - немецкая овчарка Ларс',
    'blog2':'Моя жизнь: Игры и забавы',
    'blog3':'Первый снег: Мои впечатления'
}

blog_date ={
    'blog1':'20 Января 2022 года',
    'blog2':'21 Мая 2023 года',
    'blog3' :'21 Мая 2023 года'
}

author ={
    'blog1':'Ларс',
    'blog2':'Ларс',
    'blog3':'Ларс'
}
href ={
    'blog1':'img src="../static/image/blog3-1.jpg" alt="Ларс -знакомство" class="post-image mb-4"',
    'blog2':'img src="../static/image/blog2-1.jpg" alt="Ларс -знакомство" class="post-image mb-4"',
    'blog3' :'img src="../static/image/blog1-1.jpg" alt="Ларс -знакомство" class="post-image mb-4"'
}